src/Catalogs/Subsystems.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Subsystems</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Configurations</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CommandInterface</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CommandInterfaces</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Explanation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Strings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncludeHelpInContents</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncludeInCommandInterface</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Picture</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CommonPictures</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Synonym</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Strings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Subsystems/Ext/ManagerModule.bsl
Function Load(Parameters) Export
	Var Ref, Parent;
	
	Configuration = Parameters.Configuration;
	Owner = Parameters.Owner;
	Path = Parameters.Path;
	Parameters.Property("Parent", Parent);
	
	// precondition:
	// # Parent is subsystem
	// # Path is folder path
	
	This = Catalogs.Subsystems;
	
	Data = Meta.ReadMetadataXML(Path + ".xml").Subsystem;
	PropertyValues = Data.Properties;
	ChildObjects = Data.ChildObjects;
	UUID = Data.UUID; 
	
	Object = Meta.GetObject(This, UUID, Owner, Ref);  
	
	// Properties
	
	Object.UUID = UUID;
	Object.Owner = Owner;
	Object.Parent = Parent;
	Object.Description = PropertyValues.Name;
	
	Abc.Fill(Object, PropertyValues, Abc.Lines(
	    "Comment"
		"IncludeHelpInContents"
		"IncludeInCommandInterface"
	));
	
	Meta.UpdateStrings(Configuration, Ref, Object, PropertyValues, Abc.Lines(
	    "Explanation"
		"Synonym"
	));
	
	Object.Write();
	
	// Operations
	
	ChildParameters = Meta.ObjectLoadParameters();
	ChildParameters.Configuration = Configuration;
	ChildParameters.Owner = Owner;
	ChildParameters.Insert("Parent", Ref);
	
	For Each Subsystem In ChildObjects.Subsystem Do
		
		ChildParameters.Path = Abc.JoinPath(Path, "Subsystems\" + Subsystem);
		This.Load(ChildParameters);
		
	EndDo;	
	
	Return Object.Ref;
	
EndFunction // Load()
